Repository: colilab/hosts-flow
Catalog: HostFlow/Resources/Localizable.xcstrings
Source language: en
Languages: it

# common.button.activate
source: Activate
it: Attiva

# common.button.add
source: Add
it: Aggiungi

# common.button.cancel
source: Cancel
it: Annulla

# common.button.create
source: Create
it: Crea

# common.button.deactivate
source: Deactivate
it: Disattiva

# common.button.delete
source: Delete
it: Elimina

# common.button.duplicate
source: Duplicate
it: Duplica

# common.button.edit
source: Edit
it: Modifica

# common.button.install
source: Install…
it: Installa…

# common.button.remove
source: Remove
it: Rimuovi

# common.button.rename
source: Rename
it: Rinomina

# common.button.retry
source: Retry
it: Riprova

# common.button.save
source: Save
it: Salva

# common.button.uninstall
source: Uninstall…
it: Disinstalla…

# error.helper.manifest_invalid
source: CDHash manifest signature is invalid.
it: Firma del manifest CDHash non valida.

# error.helper.manifest_missing
source: CDHash manifest is missing from the app bundle.
it: Il manifest CDHash è mancante dal bundle dell'app.

# error.helper.unauthorized
source: Caller is not authorized.
it: Chiamante non autorizzato.

# error.helper.write_failed
source: Failed to write /etc/hosts.
it: Scrittura di /etc/hosts non riuscita.

# error.import.json.invalid
source: Invalid JSON file.
it: File JSON non valido.

# error.import.json.unsupported_version
source: Unsupported version: %1$d (max supported: %2$d).
it: Versione non supportata: %1$d (massima supportata: %2$d).

# error.import.no_valid_records
source: No valid records found in the selected file.
it: Nessun record valido trovato nel file selezionato.

# error.import.read_failed
source: Could not read file: %@
it: Impossibile leggere il file: %@

# error.installer.authorization_failed
source: Authorization failed (OSStatus %d)
it: Autorizzazione fallita (OSStatus %d)

# error.installer.bundle_missing
source: Helper resource not found in app bundle: %@
it: Risorsa helper non trovata nel bundle dell'app: %@

# error.installer.script_failed
source: Privileged script failed (exit %1$d)%2$@
it: Script con privilegi fallito (exit %1$d)%2$@

# error.validation.hostname_empty
source: Hostname cannot be empty.
it: L'hostname non può essere vuoto.

# error.validation.hostname_invalid
source: Invalid hostname.
it: Hostname non valido.

# error.validation.ip_empty
source: IP address cannot be empty.
it: L'indirizzo IP non può essere vuoto.

# error.validation.ip_invalid
source: Invalid IP address (IPv4 or IPv6 expected).
it: Indirizzo IP non valido (IPv4 o IPv6 attesi).

# helper.install.prompt
source: Host Flow needs administrator privileges to install the helper.
it: Host Flow richiede privilegi di amministratore per installare l'helper.

# helper.status.error
source: Error
it: Errore

# helper.status.installed
source: Installed
it: Installato

# helper.status.label
source: Status
it: Stato

# helper.status.not_installed
source: Not installed
it: Non installato

# helper.uninstall.confirm.message
source: Administrator password will be required. Without the helper, Host Flow cannot update /etc/hosts.
it: Verrà richiesta la password di amministratore. Senza l'helper, Host Flow non potrà più aggiornare /etc/hosts.

# helper.uninstall.confirm.title
source: Uninstall the system component?
it: Disinstallare il componente di sistema?

# helper.uninstall.prompt
source: Host Flow needs administrator privileges to remove the helper.
it: Host Flow richiede privilegi di amministratore per rimuovere l'helper.

# hosts.write_alert.title
source: Failed to write /etc/hosts
it: Errore di scrittura /etc/hosts

# import.button.import
source: Import
it: Importa

# import.column.enabled
source: Enabled
it: Abilitato

# import.json.count
source: %1$d profiles, %2$d records
it: %1$d profili, %2$d record

# import.json.mode.label
source: Mode
it: Modalità

# import.json.mode.merge
source: Merge
it: Unisci

# import.json.mode.merge.description
source: Append imported profiles to the existing ones. Duplicate names get a suffix.
it: Aggiungi i profili importati a quelli esistenti. I nomi duplicati ricevono un suffisso.

# import.json.mode.replace
source: Replace
it: Sostituisci

# import.json.mode.replace.description
source: Delete all user profiles and replace them with the imported ones.
it: Elimina tutti i profili utente e sostituiscili con quelli importati.

# import.json.replace.confirm.button
source: Delete and import
it: Elimina e importa

# import.json.replace.confirm.message
source: %d existing profiles will be deleted. This action cannot be undone.
it: Verranno eliminati %d profili esistenti. L'azione non può essere annullata.

# import.json.replace.confirm.title
source: Replace all user profiles?
it: Sostituire tutti i profili utente?

# import.json.sheet.title
source: Import profiles from JSON
it: Importa profili da JSON

# import.records.count
source: %d records
it: %d record

# import.sheet.title
source: Import profile
it: Importa profilo

# menubar.item.check_updates
source: Check for Updates
it: Verifica aggiornamenti

# menubar.item.open
source: Open Host Flow
it: Apri Host Flow

# menubar.item.quit
source: Quit
it: Esci

# menubar.item.settings
source: Settings
it: Impostazioni

# menubar.toggle.active
source: Active
it: Attivo

# menubar.tooltip.active
source: Host Flow — %d active profiles
it: Host Flow — %d profili attivi

# menubar.tooltip.error
source: Host Flow — Failed to write /etc/hosts
it: Host Flow — Errore scrittura /etc/hosts

# onboarding.helper.description
source: Host Flow needs a small system component to write `/etc/hosts`. Installation requires the administrator password once. After that, changes will be applied automatically.
it: Host Flow ha bisogno di un piccolo componente di sistema per scrivere `/etc/hosts`. L'installazione richiede la password di amministratore una sola volta. Da quel momento, le modifiche saranno applicate automaticamente.

# onboarding.helper.title
source: Install the system component
it: Installa il componente di sistema

# profile.add.error.duplicate
source: A profile with this name already exists.
it: Esiste già un profilo con questo nome.

# profile.add.field.name.placeholder
source: Profile name
it: Nome profilo

# profile.add.title
source: New profile
it: Nuovo profilo

# profile.detail.button.add_record
source: Add record
it: Aggiungi record

# profile.detail.duplicate.help
source: Duplicate record — same IP/hostname pair appears multiple times
it: Record duplicato — stessa coppia IP/hostname presente più volte

# profile.detail.empty.description
source: Add a host record for this profile.
it: Aggiungi un record host per questo profilo.

# profile.detail.empty.title
source: No records
it: Nessun record

# profile.detail.export.copied
source: Copied
it: Copiato

# profile.detail.export.copy
source: Copy to clipboard
it: Copia negli appunti

# profile.detail.export.menu
source: Export
it: Esporta

# profile.detail.export.save
source: Save to file…
it: Salva su file…

# profile.detail.export.save.error.title
source: Failed to save file
it: Salvataggio non riuscito

# profile.detail.export.save.panel.title
source: Export profile
it: Esporta profilo

# profile.detail.export.saved
source: Saved
it: Salvato

# profile.detail.menu.move_to
source: Move to
it: Sposta in

# profile.detail.readonly.help
source: System profile — duplicate to edit
it: Profilo di sistema — duplica per modificare

# profile.detail.search.prompt
source: Search IP or hostname
it: Cerca IP o hostname

# profile.detail.toggle.active
source: Profile active
it: Profilo attivo

# profile.duplicate.suffix
source: %@ (copy)
it: %@ (copia)

# profile.duplicate.suffix_numbered
source: %1$@ (copy %2$d)
it: %1$@ (copia %2$d)

# profile.import.suffix
source: %@ (imported)
it: %@ (importato)

# profile.import.suffix_numbered
source: %1$@ (imported %2$d)
it: %1$@ (importato %2$d)

# record.add.title
source: New record
it: Nuovo record

# record.edit.title
source: Edit record
it: Modifica record

# record.field.ip.label
source: IP address
it: Indirizzo IP

# settings.about.auto_check
source: Automatically check for updates
it: Controlla automaticamente gli aggiornamenti

# settings.about.check_updates
source: Check for Updates
it: Verifica aggiornamenti

# settings.about.last_checked
source: Last checked: %@
it: Ultimo controllo: %@

# settings.about.version
source: Version
it: Versione

# settings.advanced.export.button
source: Export…
it: Esporta…

# settings.advanced.export.description
source: Save a JSON archive with every user profile and its records.
it: Salva un archivio JSON con tutti i profili utente e i relativi record.

# settings.advanced.export.done
source: Exported
it: Esportato

# settings.advanced.export.error.title
source: Failed to export
it: Esportazione non riuscita

# settings.advanced.export.panel.title
source: Export profiles
it: Esporta profili

# settings.advanced.export.title
source: Export all profiles
it: Esporta tutti i profili

# settings.advanced.import.button
source: Import…
it: Importa…

# settings.advanced.import.description
source: Create a new profile by importing a hosts-format file.
it: Crea un nuovo profilo importando un file in formato hosts.

# settings.advanced.import.done
source: Imported
it: Importato

# settings.advanced.import.error.title
source: Failed to import
it: Importazione non riuscita

# settings.advanced.import.hosts
source: From hosts file…
it: Da file hosts…

# settings.advanced.import.json
source: From JSON…
it: Da JSON…

# settings.advanced.import.json.panel.title
source: Import JSON
it: Importa JSON

# settings.advanced.import.panel.title
source: Import hosts file
it: Importa file hosts

# settings.advanced.import.title
source: Import profile from file
it: Importa profilo da file

# settings.advanced.reset.alert.message
source: All Host Flow profiles and their records will be removed. The managed block will be removed from /etc/hosts. This action is irreversible.
it: Verranno rimossi tutti i profili Host Flow e i loro record. Il blocco verrà rimosso da /etc/hosts. L'operazione è irreversibile.

# settings.advanced.reset.button
source: Clean
it: Pulisci

# settings.advanced.reset.description
source: Removes the block managed by Host Flow. Profiles will not be deleted.
it: Rimuove il blocco gestito da Host Flow. I profili non saranno cancellati.

# settings.advanced.reset.title
source: Clean /etc/hosts
it: Pulisci /etc/hosts

# settings.appearance.dark
source: Dark
it: Scuro

# settings.appearance.light
source: Light
it: Chiaro

# settings.appearance.picker
source: Theme
it: Tema

# settings.appearance.system
source: System
it: Sistema

# settings.language.en
source: English
it: Inglese

# settings.language.it
source: Italian
it: Italiano

# settings.language.picker
source: App language
it: Lingua app

# settings.language.system
source: System
it: Sistema

# settings.launch_alert.approval.message
source: Approval required in System Settings → General → Login Items.
it: Approvazione richiesta in System Settings → General → Login Items.

# settings.launch_alert.approval.title
source: Approval required
it: Approvazione richiesta

# settings.launch_alert.failed.message
source: Could not enable launch at login: %@
it: Impossibile attivare avvio automatico: %@

# settings.launch_alert.failed.title
source: Error
it: Errore

# settings.launch_alert.open_settings
source: Open System Settings
it: Apri System Settings

# settings.launch_at_login
source: Launch at login
it: Avvia al login

# settings.section.advanced
source: Advanced
it: Avanzate

# settings.section.appearance
source: Appearance
it: Aspetto

# settings.section.general
source: General
it: Generale

# settings.section.helper
source: System component
it: Componente di sistema

# sidebar.button.new_profile
source: New profile
it: Nuovo profilo

# sidebar.delete.message
source: This action cannot be undone. All associated records will be removed.
it: L'azione non può essere annullata. Tutti i record associati verranno rimossi.

# sidebar.delete.title
source: Delete profile "%@"?
it: Eliminare profilo "%@"?

# sidebar.empty.select_profile.description
source: Pick a profile from the sidebar or create a new one.
it: Scegli un profilo dalla sidebar o creane uno nuovo.

# sidebar.empty.select_profile.title
source: Select a profile
it: Seleziona un profilo

# sidebar.profile.readonly.help
source: System profile — duplicate to edit
it: Profilo di sistema — duplica per modificare

# sidebar.write_in_progress.help
source: Writing to /etc/hosts…
it: Scrittura /etc/hosts in corso…
